<?php

if(!defined('BASEPATH'))
	exit('No direct script access allowed');

class Bgkoleda
{
	protected $data = array();

	public function __construct()
	{
		require_once 'phpQuery.php';

		$this->get_info();
	}

	public function get()
	{
		return $this->data;
	}

	protected function get_info()
	{
		$data = array();

		$data[] = array(
			'name' => 'Подари надежда на дете в беда',
			'subname' => 'Българската Коледа',
			'type' => 'special',
			'text' => "Българската Коледа е благотворителна инициатива под патронажа на президента на Република България. Основната ѝ цел е набирането на средства за болни български деца.
За първи път инициативата \"Българската Коледа\" се провежда през 2003 г. Организаторите на проявата имат за цел набирането на парични постъпления, главно чрез SMS-си и телефонни обаждания, както чрез персонални дарения по банков път, продажба на стикери за автомобили с логото на кампанията, дарения по интернет и чрез кредитни карти.
Всяка година стартът на \"Българската Коледа\" е на 1 декември, като кулминацията е навръх Рождество Христово (25 декември) с организиране на благотворителен спектакъл. В него вземат участие известни български личности от шоубизнеса, актьори, музиканти и спортисти. Набирането на средства чрез SMS-си и телефонни обаждания продължава до последните часове на изтичащата година, а даренията по банков път продължават и през януари.
\"Българската Коледа\" подпомага главно деца с различни по степен увреждания и заболявания. Те се определят от Българската педиатрична асоциация, Асоциацията по неонатология, Министерството на здравеопазването и организаторите на благотворителната инициатива.",
			'donation' => 1,
			'picture' => 'http://bgkoleda.bg/store/images/logo-bg-prolet.png',
			'link' => 'http://bgkoleda.bg/napravi-darenie',
			'sms_text' => '',
			'sms_number' => 1117,
			'date_from' => 0
		);

		$this->data = $data;
	}
}
